[Heros_names.A_Slyen_Name H7GlobalName]
mName="斯莱恩"

[Heros_names.A_Graam_Name H7GlobalName]
mName="格拉姆"

[Heros_names.A_Amalya_Name H7GlobalName]
mName="阿玛莉娅"

[Hero_specialisation.A_vitality_t3_Buff H7BaseBuff]
mName="冰霜之心"
mTooltip=""

[Hero_specialisation.A_Vitality_t3 H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冰霜之心"
mTooltip="此英雄在整个战斗期间为严冬幻影和霜冻幻影提供 %buff.buff.stat %icon_health 点生命值的活力加成。"

[Hero_specialisation.A_Maitre_t1 H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寒冰守卫大师"
mTooltip="总督：增加守护者和雪地战士的 %buff1.buff.stat 产量。"

[Attaque_hero.A_HeroAttack_Might H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="英雄攻击"
mTooltip="对敌方单位造成 %d.min 到 %d.max 点伤害。"

[Archetype.A_Amalia H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Amalia H7HeroBioData]
mText="神圣猎鹰帝国对塔拉德的入侵结束了阿玛莉娅幸福平静的生活。当骑士们将她的村庄烧成平地时，他们将所有幸存精灵卖给了奴隶贩子，剥夺了西莱纳孩子们的自由。在前往奴隶市场的漫长旅途中，运送“活货”的商队必须穿越龙脉隘口，并在那里遭到野兽袭击。商队成员担心自己的性命，将俘虏们留下任其被撕成碎片，就在那时，阿玛莉娅沉睡的力量苏醒了。回应她心灵中的求救呼唤，树木突然活了过来，围绕在精灵们周围，抵挡住掠食者的猛攻，直到联盟部队抵达。到达最近的城市后，这些前奴隶成为了秘密山国的一部分，阿玛莉娅通过了玛夏纳的启蒙，成为树丛的守护者。作为对获救的感激，她决定投身于照料树胡。"

[Archetype.A_graam H7EditorHero]
mName="格拉姆"
mLore="格拉姆对政治从不感兴趣。研究和魔法一直是他目标。当被委以拉马克 Lesser Enlightened One 顾问之一的重任时，他非常惊讶。他谦卑地接受了职责并执行任务，但占据他心神和大部分时间的，是魔法研究。尤其是他身为大师的冰系魔法。"

[heropedya.A_HeroBio_graam H7HeroBioData]
mText="科学研究和魔法学习一直是格拉姆的热情所在。凭借他的功绩，他荣获殊荣，成为了寒冰巨兽的学徒。这位大法师从他的导师那里获得了大量独特知识，包括世界结构及其法则，以及学习冰魔法隐藏秘密的机会。后来，当议会选举他作为拉马克 Lesser Enlightened One 的顾问候选人时，这些知识被证明对这位法师很有用。尽管格拉姆从未表现出对政治的太大兴趣，但他已准备好不辜负对他的信任，并谦卑地接受了任命。在定期履行职责的同时，他取得了一些成功，但大法师仍然更喜欢将大部分时间花在他的实验室里，领悟巫术的新秘密并提高他的冰魔法造诣。"

[Archetype.A_Slyen H7EditorHero]
mName="斯莱恩"
mLore="乌库尔军校最杰出的毕业生。关于斯莱恩的传说遍布整个联盟。据说他从未输过任何一场战斗，无论是决斗还是指挥。他的战术意识，利用军队和地形的优势，以及发现敌人的弱点，使他成为冰峰联盟指挥官中的佼佼者。从未有过斯莱恩处理不了的情况。"

[Hero_specialisation.A_Vitality_t3_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冰霜之心"
mTooltip="此英雄为友方树胡和树胡守望者提供 %buff1.buff.stat %icon_Health 点生命值加成，持续至战斗结束。"

[Hero_specialisation.A_maitre_t1_Buff H7BaseBuff]
mName="大师武器"
mTooltip=""

[Hero_specialisation.A_Vitality_Buff_t3_Spec H7BaseBuff]
mName="活力"
mTooltip=""

[Hero_specialisation.A_Briseur_de_glace H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="破冰者"
mTooltip="当英雄对冻结的敌人造成伤害时，他会造成额外的 %d1 点 %icon_water 伤害。"

[Hero_specialisation_valentine.A_ice_pick_Buff H7BaseBuff]
mName="寒冰箭术副官"
mTooltip="%stat1 %icon_health 加成。此生物总是进行全额射程攻击。"

[Hero_specialisation_valentine.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="临界线"
mTooltip="被击中的生物遭受 %d1 %ICON_Water 点水属性伤害，目标相邻的敌方生物也同样受害。"

[Hero_specialisation.A_maitre_t5_Buff H7BaseBuff]
mName="冰霜魔法大师"
mTooltip=""

[Hero_specialisation.A_Maitre_t5 H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="猩红之塔守护者"
mTooltip="总督：每周增加学者和巫师导师的 %buff1.buff.stat 产量。"

[Hero_specialisation.A_lieutenant_t2_Buff H7BaseBuff]
mName="寒冰箭术副官"
mTooltip="%stat1 %icon_health 加成。此生物总是进行全额射程攻击。"

[Hero_specialisation.A_Lieutenant_t2 H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寒冰箭术副官"
mTooltip="此英雄增加流亡者和寒冰游侠 %buff1.buff.stat1 %icon_health 点生命值，并且此生物总是进行全额射程攻击。"

[Archetype.A_lotus H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Lotus H7HeroBioData]
mText="作为娜迦与联盟之间和平条约的一部分，每个国家不时会派出代表进行经验交流。莲也被列入其中一个代表团，成为获准访问传奇珊提瑞的少数人之一。那时她已经领导一支寒冰游侠小队，并认为自己是一名优秀的弓箭手，但娜迦的弓术 mastery 让她对自己的技能产生了怀疑。娜迦 Yokujins 的训练课程对莲来说是一次艰难的考验，只有她天生的固执让她没有半途而废。回到联盟后，她成功地将所学知识应用于实践，使她的队伍更具韧性和强大。"

[Archetype.A_Serraphiel H7EditorHero]
mName="塞拉菲埃尔"
mLore="塞拉菲埃尔常被称为东方贤者。冷静，镇定，不感情用事，总是温柔地微笑着。他向任何寻求帮助的人提供建议和援助。在整个联盟中，他拥有最强大法师之一的地位，但出于谦逊，他满足于猩红之塔管事的头衔，在那里他教导下一代大法师。"

[heropedya.A_HeroBio_Seraphiel H7HeroBioData]
mText="与九人环不同，贤者议会的成员彼此视作平等，无需选举领袖。然而，如果这种情况真的出现，那么所有人都会一致投票给被称为东方贤者的塞拉菲埃尔。作为议会中最年长的大法师之一，他因其丰富的人生经验而备受尊敬，许多人前来向他请教，以解决发生的冲突。即使在最困难的情况下，塞拉菲埃尔也保持冷静，慈祥地微笑着，并始终向任何求助的人提供支持与帮助。在整个联盟中，他被称为最强大的法师之一，但出于谦逊，他满足于在猩红之塔担任导师的身份，在那里他教导下一代大法师。"

[Archetype.A_mushi H7EditorHero]
mName="穆西"
mLore="穆西是一个普通铁匠和旅馆老板的女儿。她的梦想是改善自己和家庭的命运。她每天花数小时训练，为了进入乌库尔学校。当她成功进入后，她更加努力地学习以完成学业。她现在是一位受人尊敬的将军，驻扎在他的家乡恩提尔，负责指挥该市的防御。"

[heropedya.A_HeroBio_Mushi H7HeroBioData]
mText="穆西是一个普通铁匠和旅馆老板的女儿。她的梦想是改善自己和家庭的命运。她每天花数小时训练，为了进入乌库尔学校。当她成功进入后，她更加努力地学习以完成学业。她现在是一位受人尊敬的将军，驻扎在他的家乡恩提尔，负责指挥该市的防御。"

[Archetype.A_Slyen H7EditorHero]
mName="斯莱恩"
mLore="乌库尔军校最杰出的毕业生。关于斯莱恩的传说遍布整个联盟。据说他从未输过任何一场战斗，无论是决斗还是指挥。他的战术意识，利用军队和地形的优势，以及发现敌人的弱点，使他成为冰峰联盟指挥官中的佼佼者。从未有过斯莱恩处理不了的情况。"

[heropedya.A_HeroBio_slyen H7HeroBioData]
mText="即使在乌库尔军校学习期间，斯莱恩也被认为是同龄人中的天才，许多老师都认可他的勤奋和对知识的渴望。他在战争研究方面取得了最大成功，他的武器 mastery 至今仍是传奇。据说他一生中从未输过一场战斗，无论是模拟决斗还是真实战斗。利用军队和地形优势的战术意识以及发现敌人弱点的能力，使斯莱恩成为冰峰联盟最好的指挥官。只要“乌库尔之盾”屹立不倒，守护着他的家园，就没有他处理不了的情况。"

[Archetype.A_Valentine H7EditorHero]
mName=""
mLore=""

[Heros_names.A_Lotus_Name H7GlobalName]
mName="莲"

[Heros_names.A_Serraphiel_Name H7GlobalName]
mName="塞拉菲埃尔"

[Heros_names.A_Slyen_Name H7GlobalName]
mName="斯莱恩"

[Heros_names.A_Valentine_Name H7GlobalName]
mName="瓦伦丁"

[heropedya.A_HeroBio_Valentin H7HeroBioData]
mText="一位全副武装的魁梧陌生人出现在仪式竞技场，让所有霜巨人都感到惊讶。即使作为一个低地人，那个自称瓦伦丁的战士也像大多数霜巨人一样高大，并给人一种经验丰富的战士的印象。像一块坚不可摧的岩石，他坚定地迈向胜利，击败了部落中最强的战士，直到与冠军交锋的时刻到来。一场艰苦的战斗，双方都竭尽全力，持续了几个小时，但最终强大的霜巨人被迫放弃了他的头衔。凭借胜利者的权利，瓦伦丁使用了霜巨人的神圣遗物，沉寂了几个世纪的战号在他手中复苏。它响亮的声音让所有霜巨人都知道，被选中的冠军已经到来，他将带领他们走向对抗时间尽头的光荣战斗。"

New class names (1.25)

[Heroes_class.A_Frost_Magic_Balanced H7HeroClass]
mName="大法师"

[Heroes_class.A_Frost_Magic_Defensive H7HeroClass]
mName="寒冰护卫"

[Heroes_class.A_Frost_Magic_Offensive H7HeroClass]
mName="先知"

[Heroes_class.A_Frost_Might_Balanced H7HeroClass]
mName="攀登者"

[Heroes_class.A_Frost_Might_Defensive H7HeroClass]
mName="山地人"

[Heroes_class.A_Frost_Might_Offensive H7HeroClass]
mName="破冰者"

v1.35

[Hero_specialisation_valentine.A_add_nova_t7_hero H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="巨人护卫"
mTooltip="英雄军队中的毁灭者和撼山者不能成为任何魔法学派的负面法术或效果的目标，并且来自敌方攻击的所有魔法伤害减半。"